#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
jobs/create_cluster/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/stone_devops_project/stone_devops_project/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/stone_devops_project/stone_devops_project

To view this run in a browser, visit:
https://app.terraform.io/app/sandesvitor/stone-project-create-eks-cluster/runs/run-1aLStr4Cxk2k5MQ9

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cluster_network.aws_eip.eip[0] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.cluster_network.aws_eip.eip[1] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.cluster_network.aws_eip.eip[2] will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.cluster_network.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "cluster-1-sa-east-1-internet_gateway"
        }
      + vpc_id   = (known after apply)
    }

  # module.cluster_network.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat/sa-east-1a"
        }
    }

  # module.cluster_network.aws_nat_gateway.nat_gw[1] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat/sa-east-1b"
        }
    }

  # module.cluster_network.aws_nat_gateway.nat_gw[2] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat/sa-east-1c"
        }
    }

  # module.cluster_network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "private_0"
        }
      + vpc_id           = (known after apply)
    }

  # module.cluster_network.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "private_1"
        }
      + vpc_id           = (known after apply)
    }

  # module.cluster_network.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "private_2"
        }
      + vpc_id           = (known after apply)
    }

  # module.cluster_network.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.cluster_network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_network.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_network.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.0.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "private_subnet/sa-east-1a"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                        = {
          + "Name"                                      = "private_subnet/sa-east-1a"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.cluster_network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.16.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "private_subnet/sa-east-1b"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                        = {
          + "Name"                                      = "private_subnet/sa-east-1b"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.cluster_network.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.32.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "private_subnet/sa-east-1c"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                        = {
          + "Name"                                      = "private_subnet/sa-east-1c"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.cluster_network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.128.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "public_subnet/sa-east-1a"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                        = {
          + "Name"                                      = "public_subnet/sa-east-1a"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.cluster_network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.144.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "public_subnet/sa-east-1b"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                        = {
          + "Name"                                      = "public_subnet/sa-east-1b"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.cluster_network.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.160.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "public_subnet/sa-east-1c"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                        = {
          + "Name"                                      = "public_subnet/sa-east-1c"
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.cluster_network.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "cluster-vpc/stone_project"
        }
      + tags_all                         = {
          + "Name" = "cluster-vpc/stone_project"
        }
    }

  # module.eks_cluster.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks_cluster.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks_cluster.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "cluster-1-sa-east-1"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_cluster.aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type             = "AL2_x86_64"
      + arn                  = (known after apply)
      + capacity_type        = "ON_DEMAND"
      + cluster_name         = "cluster-1-sa-east-1"
      + disk_size            = 50
      + force_update_version = false
      + id                   = (known after apply)
      + instance_types       = [
          + "t3.small",
        ]
      + node_group_name      = "managed_node_group-1"
      + node_role_arn        = (known after apply)
      + release_version      = (known after apply)
      + resources            = (known after apply)
      + status               = (known after apply)
      + subnet_ids           = (known after apply)
      + tags                 = {
          + "kubernetes.io/cluster/cluster-1-sa-east-1" = "shared"
        }
      + version              = (known after apply)

      + scaling_config {
          + desired_size = 5
          + max_size     = 6
          + min_size     = 1
        }
    }

  # module.eks_cluster.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster_iam_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_cluster.aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "node_group_iam_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.stone_project-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "stone_project-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "node_group_iam_role"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.stone_project-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "stone_project-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "cluster_iam_role"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.stone_project-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "stone_project-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "cluster_iam_role"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.stone_project-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "stone_project-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "node_group_iam_role"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.stone_project-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "stone_project-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "node_group_iam_role"
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_ca_certificate = (known after apply)
  + host                   = (known after apply)
  + token                  = (known after apply)
```
</details>
*Pusher: @sandesvitor, Action: `pull_request`*